{
    "Office Visits/Exams": {
        "Periodic Evaluation": "D0120 * Routine check-up for established patients to monitor oral health changes (6-months).",
        "Limited Evaluation (Emergency)": "D0140 * Problem-focused exam for specific issues like pain, swelling, or trauma.",
        "Comprehensive Evaluation (New Patient)": "D0150 * Thorough initial exam including full health history and head/neck cancer screening.",
        "Periodontal Evaluation": "D0180 * Specialized exam for gum disease patients involving detailed pocket depth measurements.",
        "Full Mouth (FMX)": "D0210 * X-Rays A complete set of individual films (18-20) showing all teeth and roots.",
        "Bitewings (4 Films)": "D0274 * Specific X-rays used to detect cavities between posterior (back) teeth.",
        "Panoramic Film": "D0330 * A single wide-view X-ray of the entire jaw, used for wisdom teeth or implants."
    },
    "Preventive/Adjunctive": {
        "Prophylaxis Adult (Cleaning)": "D1110 * Standard preventive cleaning to remove plaque/stain from a healthy mouth.",
        "Prophylaxis Child": "D1120 * Preventive cleaning tailored for pediatric patients with primary or mixed dentition.",
        "Topical Fluoride": "D1208 * Mineral treatment applied to teeth to strengthen enamel and prevent decay.",
        "Fluoride Varnish": "D1206 * Concentrated, sticky fluoride that stays on teeth longer for high-risk patients.",
        "Sealant (per tooth)": "D1351 * Plastic coating applied to deep pits of molars to prevent childhood cavities.",
        "Occlusal Guard (Nightguard) - Hard": "D9944 * Custom removable appliance used to prevent damage from grinding or clenching.",
        "Occlusal Guard (Nightguard) - Soft": "D9945 * Flexible appliance for light grinding or symptomatic relief of jaw tension.",
        "Occlusal Adjustment (Limited)": "D9951 * Reshaping biting surfaces to fix high spots or minor bite misalignments."
    },
    "Prosthodontics (Fixed & Removable)": {
        "Complete Denture Maxillary": "D5110 * Removable appliance replacing all natural teeth in the upper jaw.",
        "Complete Denture Mandibular": "D5120 * Removable appliance replacing all natural teeth in the lower jaw.",
        "Pontic - Porcelain Fused to Metal": "D6240 * The artificial 'floating' tooth in a fixed bridge that fills the gap.",
        "Retainer Crown Porcelain/Ceramic": "D6740 * The anchor crown cemented to a natural tooth to support a bridge."
    },
    "Restorative": {
        "Amalgam (Silver) 1 Surface": "D2140 * Metallic silver/mercury filling used primarily on posterior teeth.",
        "Resin (White) Anterior 1 Surface": "D2330 * Tooth-colored composite filling used on front teeth (canine to canine).",
        "Resin (White) Posterior 1 Surface": "D2391 * Tooth-colored composite filling used on back teeth (pre-molars/molars).",
        "Porcelain Ceramic Crown": "D2740 * A full-coverage 'cap' used to restore the shape, size, and strength of a tooth.",
        "Core Buildup (including pins)": "D2950 * Filling material used to provide a stable base for a crown to sit on.",
        "Post and Core": "D2954 * A rod placed in a root-canaled tooth to anchor the buildup and crown.",
        "Palliative Treatment (Pain relief)": "D9110 * Minor emergency procedure to provide temporary relief of dental pain.",
        "Implant Body Placement": "D6010 * Surgical insertion of a titanium screw into the bone to act as an artificial root."
    },
    "Periododontics": {
        "SRP (4plus teeth per quadrant)": "D4341 * Deep cleaning involving scaling tartar and smoothing roots below the gumline.",
        "SRP (1 to 3 teeth per quadrant)": "D4342 * Deep cleaning focused on a smaller localized area of the mouth.",
        "Periodontal Maintenance": "D4910 * Specialized cleaning for patients with a history of SRP or gum surgery.",
        "Full Mouth Debridement": "D4355 * Preliminary heavy cleaning to allow the dentist to see the teeth for an exam."
    },
    "Endodontics": {
        "Root Canal Anterior": "D3310 * Removing infected nerve/pulp from a front tooth (usually 1 canal).",
        "Root Canal Bicuspid": "D3320 * Removing infected nerve/pulp from a middle tooth (usually 1-2 canals).",
        "Root Canal Molar": "D3330 * Removing infected nerve/pulp from a back tooth (usually 3-4 canals)."
    },
    "Oral Surgery": {
        "Simple Extraction": "D7140 * Removal of a visible tooth using only forceps and elevators.",
        "Surgical Extraction": "D7210 * Removal of a tooth requiring gum incision or bone removal to reach it.",
        "Soft Tissue Impaction": "D7220 * Extraction of a tooth covered primarily by gum tissue.",
        "Bony Impaction": "D7240 * Extraction of a tooth trapped partially or fully within the jawbone."
    },
    "New for 2026 (Expert Level)": {
        "Point of care Saliva Analysis": "D0426 * Immediate chairside testing of saliva for bacteria or disease markers.",
        "Comprehensive Cracked Tooth Testing": "D0461 * Specialized diagnostic tests (light/bite) to find microscopic tooth fractures.",
        "Peri implant Debridement": "D6049 * Specialized deep cleaning for the area around a single dental implant.",
        "Occlusal Guard Cleaning": "D9936 * Professional cleaning and inspection of a patient's existing nightguard.",
        "Denture Duplication": "D5877/D5878 * Creating an exact copy of a current denture to serve as a spare."
    }
}